{
    "badge": {
        "description": "Badges add information. For more details on the markup, please review the Badge documentation on the <a href=\"https://www.lightningdesignsystem.com/components/badges\">Lightning Design System website</a>.",
        "displayName": "SLDSButton",
        "props": {
            "text": {
                "type": {
                    "name": "string"
                },
                "required": false,
                "description": "Typically text that is inserted into the badge, although it could contain icons and other visuals."
            },
            "theme": {
                "type": {
                    "name": "<code>base</code> | <code>default</code> | <code>shade</code> | <code>inverse</code> | <code>alt-inverse</code> | <code>info</code> | <code>success</code> | <code>warning</code> | <code>error</code> | <code>offline</code> | <code>shade-alert-texture</code>"
                },
                "required": false,
                "description": "",
                "defaultValue": "null"
            }
        }
    },
    "button": {
        "description": "The Button should be used for label buttons, icon buttons, or buttons that have both labels and icons. \nFor more details on the markup, please review the Button documentation on the <a href=\"http://www.lightningdesignsystem.com/components/buttons\">Lightning Design System website</a>."
    },
    "button-group": {
        "description": "For more details on the markup, please review the Button Group documentation on the <a href=\"http://www.lightningdesignsystem.com/components/button-groups\">Lightning Design System website</a>."
    },
    "combobox": {
        "description": "A Combobox is similiar to the Lookup contorl. It is a dropdown menu paired with a text input form element, but allows any input."
    },
    "data-table": {
        "description": "Data tables are an enhanced version of an HTML table and are used to display tabular data.\nFor more details on the markup, please review the Lookup > Base documentation on the <a href=\"http://www.lightningdesignsystem.com/components/data-tables\">Lightning Design System website</a>."
    },
    "lookup": {
        "description": "Lookup is an advanced inline search form.\nFor more details on the markup, please review the Lookup > Base documentation on the <a href=\"http://www.lightningdesignsystem.com/components/lookups\">Lightning Design System website</a>."
    },
    "dropdown": {
        "description": "\nFor more details on the markup, please review the Menu > Dropdown documentation on the <a href=\"http://www.lightningdesignsystem.com/components/menus#dropdown\">Lightning Design System website</a>."
    },
    "picklist": {
        "description": "A picklist is a list of actionable items that is invoked by selection of a particular item. \nFor more details on the markup, please review the Menu > Picklist documentation on the <a href=\"http://www.lightningdesignsystem.com/components/menus#picklist\">Lightning Design System website</a>."
    },
    "modal": {
        "description": "Modals are used to display content in a layer above the app. This paradigm is used in cases such as the creation or editing of a record, as well as various types of messaging and wizards. The Modal opens from a trigger element from outside of the control itself.\nFor more details on the markup, please review the Lightning Design System website's <a href=\"https://www.lightningdesignsystem.com/components/modals\"> Modal documentation</a> or the <a href=\"http://www.lightningdesignsystem.com/components/notifications#prompt\">Notification > Prompt documentation</a>."
    },
    "notification": {
        "description": " For prompt notifications, use the Modal control.\nThe Notification is triggered by an element outside of the control itself.\nFor more details on the markup, please review the Notification documentation on the <a href=\"http://www.lightningdesignsystem.com/components/notifications\">Lightning Design System website</a>."
    },
    "pills": {
        "description": "Within a form control, a pill represents an existing item in a database, as opposed to user-generated freeform text. \nFor more details on the markup, please review the Pills documentation on the <a href=\"http://www.lightningdesignsystem.com/components/pills\">Lightning Design System website</a>."
    },
    "popover": {
        "description": "A popover is a non-modal dialog. \nFor more details on the markup, please review the Popover > Tooltip documentation on the <a href=\"http://www.lightningdesignsystem.com/components/popovers\">Lightning Design System website</a>."
    },
    "tooltip": {
        "description": "Tooltips provide additional information about a particular input field or element on the page. The popup text appears when the user hovers or tabs into the “info” icon and disappears when the user hovers off or tabs away.\nFor more details on the markup, please review the Tooltip documentation on the <a href=\"http://www.lightningdesignsystem.com/components/popovers#tooltips\">Lightning Design System website</a>."
    },
    "datepicker": {
        "description": "A datepicker is a text input form element with a calendar. You can select a single date or date range from a popup or inline calendar. \nFor more details on the markup, please review the Datepicker documentation on the <a href=\"http://www.lightningdesignsystem.com/components/popovers#datepickers\">Lightning Design System website</a>."
    },
    "tree": {
        "description": "A tree is visualization of a structure hierarchy. A branch can be expanded or collapsed. \nFor more details on the markup, please review the Tree documentation on the <a href=\"http://www.lightningdesignsystem.com/components/popovers#trees\">Lightning Design System website</a>."
    },
    "radio": {
        "description": "Radio buttons are shown in a group of two or more. The user can only select one radio button at a time. You should use the same name attribute on all radio buttons in the group. This ensures that if there is more than one group in the form, each one stays associated with its own group. The ability to style radio buttons with CSS varies across browsers. To ensure that radio buttons look the same everywhere, we use a custom DOM. \nFor more details on the markup, please review the Radio documentation on the <a href=\"http://www.lightningdesignsystem.com/components/forms#radio\">Lightning Design System website</a>."
    },
    "checkbox": {
        "description": "The ability to style checkboxes with CSS varies across browsers. To ensure that checkboxes look the same everywhere, we use a custom DOM. \nFor more details on the markup, please review the Forms > Checkbox documentation on the <a href=\"http://www.lightningdesignsystem.com/components/forms#checkbox\">Lightning Design System website</a>."
    },
    "spinner": {
        "description": "Spinners are animated GIFs that should be shown when retrieving data or performing slow computations. \nFor more details on the markup, please review the Spinners documentation on the <a href=\"http://www.lightningdesignsystem.com/components/spinners\">Lightning Design System website</a>."
    }
}